from secret import BOT_TOKEN, GIGACHAT_API_KEY

BOT_CONFIG = {
    'admin_ids': [5159491775],
}

EVENT_CRITERIA = {
    'target_audience': [
        'IT-специалисты',
        'Data Scientist',
        'AI разработчики', 
        'Руководители IT-проектов',
        'Архитекторы систем',
        'DevOps инженеры'
    ],
    'themes': [
        'Искусственный интеллект',
        'Машинное обучение',
        'Data Science',
        'Большие данные',
        'Облачные технологии',
        'Кибербезопасность',
        'DevOps',
        'Микросервисы',
        'Блокчейн',
        'Квантовые вычисления'
    ],
    'premium_organizers': [
        'Сбер',
        'Яндекс',
        'VK',
        'Газпром',
        'Ростелеком',
        'Тинькофф',
        'МТС',
        'МегаФон',
        'РЖД',
        'Росатом'
    ]
}